app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
---
  def index
    @profiles=Profile.all

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", nil]]
---
  def edit
    @profile = Profile.find(params[:id])

INSERT INTO "profiles" ("name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "pp"], ["phone", 11.0], ["created_at", "2018-02-18 06:12:12.217357"], ["updated_at", "2018-02-18 06:12:12.217357"]]
---
  def create
    @profile = Profile.new(profile_params)
    if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @profile = Profile.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "profiles" SET "name" = ?, "phone" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["name", "Kate"], ["phone", 1569876.0], ["updated_at", "2018-02-18 07:36:11.815025"], ["id", 12]]
---
  def update
    @profile = Profile.find(params[:id])
    if @profile.update(profile_params)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 17]]
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 17]]
---
  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy